Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиОперативныйУчетОстатковНЗП</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПартионныйУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериямВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВоспроизводства</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Набор</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеИспользования</name>
    <type>
      <types>CatalogRef.НазначенияИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджерЗаПокупки</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнешняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнутренняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыпуска</name>
    <type>
      <types>EnumRef.НаправленияВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеСписанияВыпущеннойПродукции</name>
    <type>
      <types>CatalogRef.НаправленияСписанияВыпущеннойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПрисвоенияСерийногоНомера</name>
    <type>
      <types>CatalogRef.ПорядокПрисвоенияСерийныхНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКП</name>
    <comment>Общероссийский классификатор продукции</comment>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусНоменклатуры</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РотацияНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеИспользоватьПриПодборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТУ</name>
    <type>
      <types>CatalogRef.Лео_ТехническиеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТипУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ОрганолептическиеПоказатели</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказателиБезопасности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ФормаВыпуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ВнешнийВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ИмяСпец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОперативныйСтатусНоменклатуры</name>
    <type>
      <types>CatalogRef.Лео_ОперативныйСтатусНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_ДопДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_белки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_жиры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_углеводы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_КК</name>
    <comment>Энергетическая ценность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Аллерген</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_АдресХранения</name>
    <type>
      <types>CatalogRef.Лео_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_РодительНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НоменклатураДляЗамены</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СДИЗ</name>
    <comment>сопроводительный документ по идентификации зерна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Замес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_АртикулыПокупателя</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПокупателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

InformationRegisters/абс_ТоварыСертификатов/абс_ТоварыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ТоварыСертификатов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ВидыСертификатовНаТовары/абс_ВидыСертификатовНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыСертификатовНаТовары</name>
  <enumValues>
    <name>ДекларацияСоответствия</name>
  </enumValues>
  <enumValues>
    <name>СертификатСоответствия</name>
  </enumValues>
  <enumValues>
    <name>СвидетельствоОГосрегистрации</name>
  </enumValues>
  <enumValues>
    <name>УдостоверениеКачества</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияТаможенногоСоюза</name>
  </enumValues>
</mdclass:Enum>

Catalogs/Номенклатура/ObjectModule.bsl
Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;
Перем ПрошлыйИзмененныйРодительОбъектаДоступа;

Перем мЭтоНеНовый Экспорт;

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мЭтоНеНовый = Неопределено Тогда
		мЭтоНеНовый = Не ЭтоНовый();
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		//Для элемента требуется проверять заполнение реквизита ВидНоменклатуры
		ПроверяемыеРеквизиты.Добавить("ВидНоменклатуры");
	КонецЕсли;
	
	Если (ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
		
		// Базовая единица может быть не заполнена
		НомерУдаляемогоЭлемента = ПроверяемыеРеквизиты.Найти("БазоваяЕдиницаИзмерения");
		Если НомерУдаляемогоЭлемента <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоЭлемента);
		КонецЕсли;
		
	КонецЕсли;
	
	// Надо проверить владельца единицы хранения остатков.
	Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
		И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
		ТекстСообщения = НСтр("ru = 'Неверно указан владелец единицы хранения остатков!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ЕдиницаХраненияОстатков",, Отказ);
	КонецЕсли;
	
	// Надо проверить владельца единицы для отчетов.
	Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
		И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
		ТекстСообщения = НСтр("ru = 'Неверно указан владелец единицы для отчетов!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ЕдиницаДляОтчетов",, Отказ);
	КонецЕсли;
	
	Если мЭтоНеНовый И НЕ ЭтоГруппа Тогда
		СуществуютСсылки = Неопределено;
		
		Если (ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга)
			И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков 
			И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
			
			ТекстСообщения = НСтр("ru = 'Номенклатура уже участвует в товародвижении. 
			|Изменить единицу хранения остатков уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ЕдиницаХраненияОстатков",, Отказ);
		КонецЕсли;
		
		Если ВидНоменклатуры.ТипНоменклатуры <> Ссылка.ВидНоменклатуры.ТипНоменклатуры
			И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
			
			ТекстСообщения = НСтр("ru = 'Номенклатура уже участвует в товародвижении. 
			|Тип номенклатуры не может быть изменен'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВидНоменклатуры",, Отказ);
		КонецЕсли;
		
		Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
			ТекстСообщения = НСтр("ru = 'Номенклатура уже участвует в товародвижении. 
			|Признак ""Вести учет по сериям"" не может быть изменен!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВестиУчетПоСериям",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

// Обработчик события элемента ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		ОсновноеИзображение     = Неопределено;
		НазначениеИспользования = Неопределено;
		лео_ИмяСпец             = Неопределено;
		Лео_ОКК_ТУ              = Неопределено;
		Лео_Аллерген	        = Неопределено;
		Лео_АдресХранения       = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		Услуга   = (ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
		Набор    = (ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор);
		Комплект = (ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект);
		
		Если Услуга ИЛИ Набор Тогда
			ВестиУчетПоХарактеристикам = Ложь;
		КонецЕсли;
		
		Если ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
			
			ВестиУчетПоСериям 				 = Ложь;
			ВестиПартионныйУчетПоСериям 	 = Ложь;
			Весовой 						 = Ложь;
			ВестиОперативныйУчетОстатковНЗП  = Ложь;
			ВестиУчетПоСериямВНЗП 			 = Ложь;
			ВестиСерийныеНомера 			 = Ложь;
			
			НомерГТД                         = Неопределено;
			СтранаПроисхождения              = Неопределено;
			НазначениеИспользования          = Неопределено;
			ПорядокПрисвоенияСерийногоНомера = Неопределено;
			НаправлениеВыпуска               = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//<< Горбунов Добавил исключение группы
	Если Не ЭтоГруппа Тогда
		//АБС 26.05.2014 44000
		Если ТребуетсяВнешняяСертификация и Не ЭтоНовый()  Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ абс_ТоварыСертификатовСрезПоследних.Регистратор.ВидСертификата) КАК КоличествоВидовСертификата
			|ИЗ
			|	РегистрСведений.абс_ТоварыСертификатов.СрезПоследних(
			|			&ДатаОстатков,
			|			Номенклатура = &Номенклатура
			|				И Регистратор.ВидСертификата В (&СписокВидыСертификатов)
			|				И (Регистратор.ДатаОкончанияДействияСертификата = ДАТАВРЕМЯ(1, 1, 1)
			|					ИЛИ Регистратор.ДатаОкончанияДействияСертификата >= &ДатаОстатков)
			|				И НЕ Регистратор.Неактуальный) КАК абс_ТоварыСертификатовСрезПоследних";
			
			
			СписокВидыСертификатов = Новый СписокЗначений;
			СписокВидыСертификатов.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия);
			СписокВидыСертификатов.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза);
			СписокВидыСертификатов.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации);
			СписокВидыСертификатов.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.СертификатСоответствия);
			Запрос.УстановитьПараметр("СписокВидыСертификатов", СписокВидыСертификатов);
			Запрос.УстановитьПараметр("Номенклатура", Ссылка);
			Запрос.УстановитьПараметр("ДатаОстатков", абс_СерверныеФункции.ПолучитьДатуСервера());
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.КоличествоВидовСертификата < 4 Тогда
					Сообщить("По данной номенклатуре отсутствует полный комплект сертификатов:
					|""Свидетельство соответствия"", ""Декларация о соответствии"", ""Декларация таможенного союза"" и ""Свидетельство о госрегистрации"".");
					
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Сообщить("По данной номенклатуре отсутствует полный комплект сертификатов:
				|""Свидетельство соответствия"", ""Декларация о соответствии"", ""Декларация таможенного союза"" и ""Свидетельство о госрегистрации"".");
				
				Отказ = Истина;
			КонецЕсли;
			
			
		КонецЕсли;
		//АБС 26.05.2014 44000	
	КонецЕсли;
	//<< Горбунов Добавил исключение группы
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка,ПрошлыйИзмененныйРодительОбъектаДоступа, Отказ);
	КонецЕсли;	
КонецПроцедуры
